ZQH306/STM32_Kitchen_System/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* 系统状态标志位 */
#define SYS_STATE_PREHEAT     0   // MQ2预热中，报警屏蔽
#define SYS_STATE_READY       1   // 传感器就绪，正常监测
#define SYS_STATE_ERROR        2   // 传感器异常

/* MQ2预热配置 */
#define MQ2_PREHEAT_TIME_SEC  6    // 预热时间（秒）
#define MQ2_STABILITY_SAMPLES 5    // 稳定性判断采样次数
#define MQ2_STABILITY_THRESHOLD 50 // PPM波动阈值

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define DHT11_Pin GPIO_PIN_13
#define DHT11_GPIO_Port GPIOC
#define FIRE_Pin GPIO_PIN_14
#define FIRE_GPIO_Port GPIOC
#define KEY2_Pin GPIO_PIN_0
#define KEY2_GPIO_Port GPIOA
#define KEY2_EXTI_IRQn EXTI0_IRQn
#define LIGHT_Pin GPIO_PIN_4
#define LIGHT_GPIO_Port GPIOA

#define MQ2_Pin GPIO_PIN_6
#define MQ2_GPIO_Port GPIOA
#define LED1_Pin GPIO_PIN_0
#define LED1_GPIO_Port GPIOB
#define LED2_Pin GPIO_PIN_1
#define LED2_GPIO_Port GPIOB
#define BUZZER_Pin GPIO_PIN_8
#define BUZZER_GPIO_Port GPIOA
#define KEY1_Pin GPIO_PIN_3
#define KEY1_GPIO_Port GPIOB
#define KEY1_EXTI_IRQn EXTI3_IRQn
#define FAN_Pin GPIO_PIN_8
#define FAN_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
